# Реализовать скрипт проверки типа данных каждого элемента.

a = [1, 'asd', None, True, 1.56, ['asd', 'dsa']]
for i in a:
    print(type(i))